#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
tls_private_key.hetzner_private_key: Refreshing state... [id=976e6cb73e196f15de378de25cb856d93156d17a]
hcloud_network.k8s_private_net: Refreshing state... [id=11620945]
hcloud_server.hetzner_ubuntu-4gb-nbg1-1: Refreshing state... [id=64731623]
hcloud_ssh_key.hetzner_ssh_key: Refreshing state... [id=29251013]
hcloud_firewall.legacy_vm: Refreshing state... [id=10471313]
hcloud_ssh_key.deployment_key: Refreshing state... [id=29750012]
hcloud_firewall.k8s_cluster: Refreshing state... [id=10471312]
module.dns.digitalocean_domain.immoly-io: Refreshing state... [id=immoly.io]
module.dns.digitalocean_domain.schluesselmomente_freiburg_de: Refreshing state... [id=schluesselmomente-freiburg.de]
module.dns.digitalocean_domain.teachly_store: Refreshing state... [id=teachly.store]
module.dns.digitalocean_domain.jakob-lingel-dev: Refreshing state... [id=jakob-lingel.dev]
module.dns.digitalocean_domain.mimis_kreativstudio_de: Refreshing state... [id=mimis-kreativstudio.de]
module.dns.digitalocean_record.teachly_store_www_blog_cname: Refreshing state... [id=1770255453]
module.dns.digitalocean_record.teachly_store_api_a: Refreshing state... [id=1809720904]
module.dns.digitalocean_record.teachly_store_app_a: Refreshing state... [id=1809720903]
module.dns.digitalocean_record.teachly_store_www_a: Refreshing state... [id=1736150325]
module.dns.digitalocean_record.teachly_store_root_a: Refreshing state... [id=1736129511]
module.dns.digitalocean_record.teachly_store_netlify_challenge_txt: Refreshing state... [id=1775013430]
module.dns.digitalocean_record.teachly_store_ns3: Refreshing state... [id=1736048764]
module.dns.digitalocean_record.teachly_store_www_auth_cname: Refreshing state... [id=1809728143]
module.dns.digitalocean_record.teachly_store_ns1: Refreshing state... [id=1736048762]
module.dns.digitalocean_record.teachly_store_blog_cname: Refreshing state... [id=1770244232]
module.dns.digitalocean_record.teachly_store_portfolio_cname: Refreshing state... [id=1775013550]
module.dns.digitalocean_record.teachly_store_auth_a: Refreshing state... [id=1809728142]
module.dns.digitalocean_record.teachly_store_ns2: Refreshing state... [id=1736048763]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_ns1: Refreshing state... [id=1776723512]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_zmail_dkim_txt: Refreshing state... [id=1777264856]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_admin_a: Refreshing state... [id=1781139199]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_api_a: Refreshing state... [id=1780508291]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_www_a: Refreshing state... [id=1776724211]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_zoho_verification_txt: Refreshing state... [id=1777263731]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_www_admin_a: Refreshing state... [id=1781147690]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_s1_dkim_txt: Refreshing state... [id=1777773174]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_mx2: Refreshing state... [id=1777264705]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_mx3: Refreshing state... [id=1777264751]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_ns2: Refreshing state... [id=1776723514]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_mx1: Refreshing state... [id=1777264684]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_root_a: Refreshing state... [id=1776723817]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_ns3: Refreshing state... [id=1776723516]
module.dns.digitalocean_record.schluesselmomente_freiburg_de_spf_txt: Refreshing state... [id=1777264988]
module.dns.digitalocean_record.jakob_lingel_dev_immoly_CNAME: Refreshing state... [id=1782036502]
module.dns.digitalocean_record.jakob_lingel_dev_www_homeatsea_CNAME: Refreshing state... [id=1807741897]
module.dns.digitalocean_record.jakob_lingel_dev_www_analytics: Refreshing state... [id=1798224424]
module.dns.digitalocean_record.jakob_lingel_dev_alemazung: Refreshing state... [id=1790821024]
module.dns.digitalocean_record.jakob_lingel_dev_ns1: Refreshing state... [id=1776334973]
module.dns.digitalocean_record.jakob_lingel_dev_www_uptime: Refreshing state... [id=1803544468]
module.dns.digitalocean_record.jakob_lingel_dev_immoly_google_verification: Refreshing state... [id=1793041158]
module.dns.digitalocean_record.jakob_lingel_dev_api_homeatsea_CNAME: Refreshing state... [id=1807741899]
module.dns.digitalocean_record.jakob_lingel_dev_argocd: Refreshing state... [id=1798180103]
module.dns.digitalocean_record.jakob_lingel_dev_uptime: Refreshing state... [id=1803544466]
module.dns.digitalocean_record.jakob_lingel_dev_www_A: Refreshing state... [id=1776336757]
module.dns.digitalocean_record.jakob_lingel_dev_homeatsea_CNAME: Refreshing state... [id=1807741898]
module.dns.digitalocean_record.jakob_lingel_dev_telemetry: Refreshing state... [id=1811080612]
module.dns.digitalocean_record.jakob_lingel_dev_www_telemetry: Refreshing state... [id=1811080611]
module.dns.digitalocean_record.jakob_lingel_dev_www_argocd: Refreshing state... [id=1798224423]
module.dns.digitalocean_record.jakob_lingel_dev_www_blog_CNAME: Refreshing state... [id=1798224425]
module.dns.digitalocean_record.jakob_lingel_dev_ns3: Refreshing state... [id=1776334975]
module.dns.digitalocean_record.jakob_lingel_dev_portfolio_A: Refreshing state... [id=1812143504]
module.dns.digitalocean_record.jakob_lingel_dev_A: Refreshing state... [id=1776336745]
module.dns.digitalocean_record.jakob_lingel_dev_notifications: Refreshing state... [id=1812601340]
module.dns.digitalocean_record.jakob_lingel_dev_analytics: Refreshing state... [id=1793025268]
module.dns.digitalocean_record.jakob_lingel_dev_ns2: Refreshing state... [id=1776334974]
module.dns.digitalocean_record.jakob_lingel_dev_blog_CNAME: Refreshing state... [id=1793047348]
module.dns.digitalocean_record.immoly_io_api_alemazung_CNAME: Refreshing state... [id=1798672742]
module.dns.digitalocean_record.immoly_io_alemazung_CNAME: Refreshing state... [id=1798672744]
module.dns.digitalocean_record.immoly_io_ns2: Refreshing state... [id=1793981663]
module.dns.digitalocean_record.immoly_io_ns1: Refreshing state... [id=1793981659]
module.dns.digitalocean_record.immoly_io_blog_CNAME: Refreshing state... [id=1793981660]
module.dns.digitalocean_record.immoly_io_www_A: Refreshing state... [id=1793981662]
module.dns.digitalocean_record.immoly_io_ns3: Refreshing state... [id=1793981664]
module.dns.digitalocean_record.immoly_io_A: Refreshing state... [id=1793981658]
module.dns.digitalocean_record.immoly_io_www_alemazung_CNAME: Refreshing state... [id=1798672741]
module.dns.digitalocean_record.immoly_io_www_api_alemazung_CNAME: Refreshing state... [id=1798672740]
module.dns.digitalocean_record.immoly_io_google_verification: Refreshing state... [id=1793982154]
module.dns.digitalocean_record.mimis_kreativstudio_de_A: Refreshing state... [id=1789898809]
module.dns.digitalocean_record.mimis_kreativstudio_de_ns3: Refreshing state... [id=1789898810]
module.dns.digitalocean_record.mimis_kreativstudio_de_www_A: Refreshing state... [id=1789898806]
module.dns.digitalocean_record.mimis_kreativstudio_de_ns1: Refreshing state... [id=1789898807]
module.dns.digitalocean_record.mimis_kreativstudio_de_ns2: Refreshing state... [id=1789898808]
hcloud_network_subnet.k8s_private_subnet: Refreshing state... [id=11620945-10.0.1.0/24]
hcloud_server.k8s_node[0]: Refreshing state... [id=112652680]
hcloud_server.k8s_node[1]: Refreshing state... [id=112652681]
hcloud_server.k8s_node[2]: Refreshing state... [id=112652679]
module.projects.aws_ssm_parameter.teachme_backend_db_username: Refreshing state... [id=/teachme/backend/db_username]
module.projects.aws_ssm_parameter.hetzner_cloud_server_1_private_ssh_key: Refreshing state... [id=/ssh/hetzner-cloud-server-1/deployment_private_ssh_key]
module.projects.aws_ssm_parameter.terraform_secrets["/infra/terraform/dns/schluesselmomente_zoho_verification"]: Refreshing state... [id=/infra/terraform/dns/schluesselmomente_zoho_verification]
module.projects.aws_ssm_parameter.terraform_secrets["/infra/terraform/dns/schluesselmomente_dkim"]: Refreshing state... [id=/infra/terraform/dns/schluesselmomente_dkim]
module.projects.aws_ssm_parameter.terraform_secrets["/infra/terraform/dns/schluesselmomente_zmail_dkim"]: Refreshing state... [id=/infra/terraform/dns/schluesselmomente_zmail_dkim]
module.projects.aws_ssm_parameter.terraform_secrets["/infra/terraform/servers/hetzner_server_1_ipv4"]: Refreshing state... [id=/infra/terraform/servers/hetzner_server_1_ipv4]
module.projects.aws_ssm_parameter.terraform_secrets["/infra/terraform/servers/hcloud_ssh_key"]: Refreshing state... [id=/infra/terraform/servers/hcloud_ssh_key]
module.projects.aws_ssm_parameter.terraform_secrets["/infra/terraform/servers/digitalocean_droplet_1_ipv4"]: Refreshing state... [id=/infra/terraform/servers/digitalocean_droplet_1_ipv4]
module.projects.aws_ssm_parameter.immoly_db_password: Refreshing state... [id=/immoly/db/password]
module.projects.aws_ssm_parameter.terraform_secrets["/infra/terraform/dns/schluesselmomente_spf"]: Refreshing state... [id=/infra/terraform/dns/schluesselmomente_spf]
module.projects.aws_ssm_parameter.terraform_secrets["/infra/terraform/providers/hcloud_token"]: Refreshing state... [id=/infra/terraform/providers/hcloud_token]
module.projects.aws_ssm_parameter.terraform_secrets["/infra/terraform/dns/portfolio_netlify_challenge"]: Refreshing state... [id=/infra/terraform/dns/portfolio_netlify_challenge]
module.projects.aws_ssm_parameter.terraform_secrets["/infra/terraform/providers/digitalocean_token"]: Refreshing state... [id=/infra/terraform/providers/digitalocean_token]
module.projects.aws_ssm_parameter.terraform_secrets["/infra/terraform/ssh_private_key_path"]: Refreshing state... [id=/infra/terraform/ssh_private_key_path]
module.projects.aws_ssm_parameter.terraform_secrets["/infra/terraform/aws/account_id"]: Refreshing state... [id=/infra/terraform/aws/account_id]
module.projects.aws_ssm_parameter.teachme_backend_jwt_secret: Refreshing state... [id=/teachme/backend/jwt_secret]
module.projects.aws_ssm_parameter.hetzner_cloud_server_1_ipv4: Refreshing state... [id=/compute/hetzner-cloud-server-1/host]
aws_iam_role.terraform_ci_role: Refreshing state... [id=terraform-ci-role]
module.projects.aws_ssm_parameter.teachme_backend_recaptcha_secret: Refreshing state... [id=/teachme/backend/recaptcha_secret]
module.projects.aws_ssm_parameter.teachme_backend_keycloak_client_secret: Refreshing state... [id=/teachme/backend/keycloak_client_secret]
module.projects.aws_ssm_parameter.teachme_keycloak_db_password: Refreshing state... [id=/teachme/keycloak/db_password]
module.projects.aws_ssm_parameter.schluesselmomente_be_mail: Refreshing state... [id=/schluesselmomente/be/mail]
module.projects.aws_ssm_parameter.teachme_backend_session_secret: Refreshing state... [id=/teachme/backend/session_secret]
module.projects.aws_ssm_parameter.joy_alemazung_strapi_api_url: Refreshing state... [id=/joy_alemazung/strapi/api_url]
module.projects.aws_ssm_parameter.joy_alemazung_strapi_db_encryption_key: Refreshing state... [id=/joy_alemazung/strapi/db/encryption_key]
module.projects.aws_ssm_parameter.message_router_api_key: Refreshing state... [id=/message-router/api-key]
module.projects.aws_ssm_parameter.umami_db_password: Refreshing state... [id=/umami/db/password]
module.projects.aws_ssm_parameter.teachme_backend_gcloud_api_key: Refreshing state... [id=/teachme/backend/gcloud_api_key]
module.projects.aws_ssm_parameter.immoly_db_user: Refreshing state... [id=/immoly/db/user]
module.projects.aws_ssm_parameter.immoly_db_name: Refreshing state... [id=/immoly/db/name]
module.projects.aws_ssm_parameter.joy_alemazung_strapi_db_password: Refreshing state... [id=/joy_alemazung/strapi/db/password]
module.projects.aws_ssm_parameter.joy_alemazung_strapi_transfer_token_salt: Refreshing state... [id=/joy_alemazung/strapi/transfer_token_salt]
module.projects.aws_ssm_parameter.schluesselmomente_be_mailgun_api_key: Refreshing state... [id=/schluesselmomente/be/mailgun_api_key]
module.projects.aws_ssm_parameter.teachme_backend_jwt_refresh_secret: Refreshing state... [id=/teachme/backend/jwt_refresh_secret]
module.projects.aws_ssm_parameter.message_router_resend_api_key: Refreshing state... [id=/message-router/resend-api-key]
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::787858641164:oidc-provider/token.actions.githubusercontent.com]
module.projects.aws_ssm_parameter.schluesselmomente_be_schluesselmomente_sendkey: Refreshing state... [id=/schluesselmomente/be/schluesselmomente_sendkey]
module.projects.aws_ssm_parameter.teachme_keycloak_keystore_password: Refreshing state... [id=/teachme/keycloak/keystore_password]
module.projects.aws_ssm_parameter.message_router_resend_api_key_full: Refreshing state... [id=/message-router/resend-api-key-full]
module.projects.aws_ssm_parameter.joy_alemazung_strapi_admin_jwt_secret: Refreshing state... [id=/joy_alemazung/strapi/admin_jwt_secret]
module.projects.aws_ssm_parameter.teachme_backend_stripe_webhook_secret: Refreshing state... [id=/teachme/backend/stripe_webhook_secret]
module.projects.aws_ssm_parameter.teachme_keycloak_admin_password: Refreshing state... [id=/teachme/keycloak/admin_password]
module.projects.aws_ssm_parameter.joy_alemazung_strapi_api_token: Refreshing state... [id=/joy_alemazung/strapi/api_token]
module.projects.aws_ssm_parameter.joy_alemazung_strapi_api_token_salt: Refreshing state... [id=/joy_alemazung/strapi/api_token_salt]
module.projects.aws_ssm_parameter.joy_alemazung_strapi_app_keys: Refreshing state... [id=/joy_alemazung/strapi/app_keys]
module.projects.aws_ssm_parameter.hetzner_cloud_server_1_openssl_private_ssh_key: Refreshing state... [id=/ssh/hetzner-cloud-server-1/openssl_deployment_private_ssh_key]
module.projects.aws_ssm_parameter.joy_alemazung_strapi_jwt_secret: Refreshing state... [id=/joy_alemazung/strapi/jwt_secret]
module.projects.aws_ssm_parameter.schluesselmomente_be_password: Refreshing state... [id=/schluesselmomente/be/password]
module.projects.aws_ssm_parameter.teachme_keycloak_db_postgres_password: Refreshing state... [id=/teachme/keycloak-db/postgres_password]
aws_iam_role.ci-role: Refreshing state... [id=ci-role]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=787858641164]
module.projects.aws_ssm_parameter.teachme_keycloak_db_username: Refreshing state... [id=/teachme/keycloak/db_username]
module.projects.aws_ssm_parameter.teachme_keycloak_admin_username: Refreshing state... [id=/teachme/keycloak/admin_username]
module.projects.aws_ssm_parameter.teachme_backend_stripe_test_key: Refreshing state... [id=/teachme/backend/stripe_test_key]
module.projects.aws_ssm_parameter.teachme_backend_db_password: Refreshing state... [id=/teachme/backend/db_password]
module.projects.aws_ssm_parameter.umami_app_secret: Refreshing state... [id=/umami/app_secret]
aws_iam_user.external_secrets: Refreshing state... [id=external-secrets-ssm]
module.projects.aws_ssm_parameter.message_router_from_email: Refreshing state... [id=/message-router/from-email]
module.projects.aws_ssm_parameter.teachme_keycloak_db_postgres_user: Refreshing state... [id=/teachme/keycloak-db/postgres_user]
hcloud_firewall_attachment.legacy_vm: Refreshing state... [id=10471313]
local_file.ansible_inventory: Refreshing state... [id=c4d4a69d47d81beef89cc7080a30817370154006]
aws_iam_role_policy.terraform_ci_policy: Refreshing state... [id=terraform-ci-role:terraform-ci-policy]
aws_iam_role_policy.ci-policy: Refreshing state... [id=ci-role:ci-policy]
aws_iam_user_policy.external_secrets_ssm: Refreshing state... [id=external-secrets-ssm:external-secrets-ssm-read]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role_policy.ci-policy will be updated in-place
  ~ resource "aws_iam_role_policy" "ci-policy" {
        id     = "ci-role:ci-policy"
        name   = "ci-policy"
      ~ policy = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.terraform_ci_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "terraform_ci_policy" {
        id     = "terraform-ci-role:terraform-ci-policy"
        name   = "terraform-ci-policy"
      ~ policy = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # aws_iam_user_policy.external_secrets_ssm will be updated in-place
  ~ resource "aws_iam_user_policy" "external_secrets_ssm" {
        id     = "external-secrets-ssm:external-secrets-ssm-read"
        name   = "external-secrets-ssm-read"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (3 unchanged elements hidden)
                            "arn:aws:ssm:eu-central-1:787858641164:parameter/message-router/*",
                          - "arn:aws:ssm:eu-central-1:787858641164:parameter/mimis_kreativstudio/*",
                          + "arn:aws:ssm:eu-central-1:787858641164:parameter/mimis-kreativstudio/*",
                            "arn:aws:ssm:eu-central-1:787858641164:parameter/schluesselmomente/*",
                            # (2 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = "ssm:DescribeParameters"
                        Effect   = "Allow"
                        Resource = "*"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # hcloud_server.k8s_node[0] will be updated in-place
  ~ resource "hcloud_server" "k8s_node" {
        id                         = "112652680"
        name                       = "k8s-node-1"
        # (20 unchanged attributes hidden)

      - network {
          - alias_ips   = [] -> null
          - ip          = "10.0.1.3" -> null
          - mac_address = "86:00:00:6d:c7:97" -> null
          - network_id  = 11620945 -> null
        }
      + network {
          + alias_ips   = (known after apply)
          + ip          = (known after apply)
          + mac_address = (known after apply)
          + network_id  = 11620945
        }
    }

  # hcloud_server.k8s_node[1] will be updated in-place
  ~ resource "hcloud_server" "k8s_node" {
        id                         = "112652681"
        name                       = "k8s-node-2"
        # (20 unchanged attributes hidden)

      - network {
          - alias_ips   = [] -> null
          - ip          = "10.0.1.1" -> null
          - mac_address = "86:00:00:6d:c7:99" -> null
          - network_id  = 11620945 -> null
        }
      + network {
          + alias_ips   = (known after apply)
          + ip          = (known after apply)
          + mac_address = (known after apply)
          + network_id  = 11620945
        }
    }

  # hcloud_server.k8s_node[2] will be updated in-place
  ~ resource "hcloud_server" "k8s_node" {
        id                         = "112652679"
        name                       = "k8s-node-3"
        # (20 unchanged attributes hidden)

      - network {
          - alias_ips   = [] -> null
          - ip          = "10.0.1.2" -> null
          - mac_address = "86:00:00:6d:c7:98" -> null
          - network_id  = 11620945 -> null
        }
      + network {
          + alias_ips   = (known after apply)
          + ip          = (known after apply)
          + mac_address = (known after apply)
          + network_id  = 11620945
        }
    }

  # local_file.ansible_inventory will be created
  + resource "local_file" "ansible_inventory" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = ".././ansible/inventory/k8s_hosts.ini"
      + id                   = (known after apply)
    }

  # module.projects.aws_ssm_parameter.mimis_kreativstudio_notifications_recipient_email_address will be created
  + resource "aws_ssm_parameter" "mimis_kreativstudio_notifications_recipient_email_address" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Notification recipient email address for mimis-kreativstudio"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/mimis-kreativstudio/notifications/recipient_email_address"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 6 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @Davidcode2, Action: `pull_request`*